[
    {
        "name": "Бот МОФ РАНХиГС",
        "description": "Чат-бот в социальной сети ВКонтакте, посвященный МОФ РАНХиГС. Проект полностью независимый и является моей личной инициативой привнести что-нибудь новое в родной вуз.",
        "long_description": "На данный момент чат-бот имеет скромный, но полезный функционал: бот умеет высылать расписание занятий любого факультета любого курса независимо от формы обучения.",
        "node_id": "ranepa-chatbot-moranepabot",
        "html_url": "https://vk.com/moranepabot",
        "language": "Python"
    },
    {
        "name": "Квест «Голос из прошлого»",
        "description": "На проекте Морковник 2022 мною было предложено разработать квест, посвященный Великой Отечественной Войне, с помощью Telegram чат-бота.",
        "long_description": "<p>Не смотря на то, что проект считается командным, квест «Голос из прошлого» от начальной концепции до написания конечных реплик в чат-боте и реализации алгоритма работы создан мною (к моим обязанностям не относилась только переферийная часть проекта: переговоры с типографей и поставщиками призов, рисование плакатов и документов для очного этапа квеста).</p> <p>Чат-бот находился по <a href='https://t.me/ww2radio_bot'>этой ссылке</a> и представлял из себя имитацию радиста, которому удается связаться с игроком по радио. Сам радист находился в 1941 году, и ему требовалась помощь. Постепенно выполняя задания радиста игрок приближал к победе не только отряд радиста, но и всю советскую армию.</p> <p>Задания квеста связаны с информационными технологиями. Всего их было 9 штук.</p> <p>Квест проводился с 11 по 15 мая 2022 года. В квесте поучаствовали 25 человек, 3 из которых стали финалистами и один - победителем.</p>",
        "node_id": "ranepa-chatbot-voicefromthepast",
        "html_url": "https://youtu.be/HFuCBn3EZic",
        "language": "Python"
    },
    {
        "name": "Бот «8 марта»",
        "description": "Чат-бот в социальной сети ВКонтакте, находившийся в группе ССА МОФ РАНХиГС с 8 по 11 мая 2022 года.",
        "long_description": " Основная задача бота - отправка открыток и поздравлений по запросу пользователя. Однако я доработал проект - создал секретное поздравление, которое высылалось при получении ботом кодового слова «весна». Секретное сообщение удалось найти четырем студенткам филиала. Первой девушке удалось отгадать загадку в 10:52 МСК 10 марта. За все время боту написало более 30 человек.",
        "node_id": "ranepa-chatbot-womanday",
        "html_url": "https://youtube.com/shorts/13TLOOLt2Us",
        "language": "Python"
    },
    {
        "name": "pyGitConnect",
        "description": "Python-библиотека для упрощенной работы с GitHub. Проект находится на стадии разработки, однако уже реализованы функции для работы с коммитами, файлами и репозиториями в аккаунте пользователя.",
        "long_description": "",
        "node_id": "pygitconnect",
        "html_url": "",
        "language": "Python"
    },
    {
        "name": "LTX Gen",
        "description": "Программа предназначалась для работы с файлами серии игр S.T.A.L.K.E.R. с целью создания новых предметов, квестов, персонажей и т.д.",
        "long_description": "",
        "node_id": "ltx-gen",
        "html_url": "",
        "language": "Python"
    },
    {
        "name": "BattleCity remake",
        "description": "Попытка доработать и значительно улучшить предыдущую версию моей игры «BattleCity20.20».",
        "long_description": "",
        "node_id": "battlecity-remake",
        "html_url": "",
        "language": "Python"
    },
    {
        "name": "SafeInImage",
        "description": "Графический интерфейс на базе Python-библиотеки tkinter для создания изображений-архивов (например: полученную картинку можно открыть и как zip, и как png файл).",
        "long_description": "",
        "node_id": "safeinimage",
        "html_url": "",
        "language": "Python"
    }
]
